app/controllers/defaults_controller.rb

  def index
    @defaults = Default.all
---
SELECT * FROM `defaults`

  def show
    @default = Default.find(params[:id])
---
SELECT * FROM `defaults` WHERE (`defaults`.`id` = 1)

  def create
    @default = Default.new(params[:default])
    if @default.save
---
INSERT INTO `defaults` (`name`, `created_at`, `updated_at`) VALUES('ahoj', '2010-10-19 15:35:10', '2010-10-19 15:35:10')

  def to_delete
    default = params[:to_delete].map {|i,k| ( Default.find(i) if k != "0" )}
    default.delete(nil)
---
SELECT * FROM `defaults` WHERE (`defaults`.`id` = '113629430') LIMIT 1
DELETE FROM `defaults` WHERE `id` = 1